Feature: Вхід в акаунт

  Scenario: Коректний вхід
    Given зайти на веб-сторінку входу (log in)
    When увести коректну пошту (із символом @)
    And увести правильний пароль
    Then відбувається вхід в акаунт

  Scenario: Некоректний вхід (неіснуючий акаунт)
    Given зайти на веб-сторінку входу (log in)
    When увести пошту і пароль неіснуючого акаунта
    Then не відбувається вхід в акаунт

  Scenario: Некоректний вхід (неправильний пароль)
    Given зайти на веб-сторінку входу (log in)
    When увести неправильний пароль до акаунта
    Then не відбувається вхід в акаунт